[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:21:17
             get => _idOwner;
             set
             {
-                value.CheckValidGuid();
+                ;
                 _idOwner = value;
             }
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetIdOwner_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:30:21
             get => _name;
             set
             {
-                if (value.Length < 3)
+                if (value.Length <= 3)
                 {
                     throw new AppException(MessagesExceptions.SizeFieldNameNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetName_Ok

[Killed] Negate expression
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:30:21
             get => _name;
             set
             {
-                if (value.Length < 3)
+                if (!(value.Length < 3))
                 {
                     throw new AppException(MessagesExceptions.SizeFieldNameNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetName_Failed; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetName_Ok; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:32:21
             {
                 if (value.Length < 3)
                 {
-                    throw new AppException(MessagesExceptions.SizeFieldNameNotValid);
+                    ;
                 }
                 _name = value;
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetName_Failed

[Killed] Negate expression
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:42:21
             get => _address;
             set
             {
-                if (value.Length < 6)
+                if (!(value.Length < 6))
                 {
                     throw new AppException(MessagesExceptions.SizeFieldAddressNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetAddress_Failed; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetAddress_Ok; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:42:21
             get => _address;
             set
             {
-                if (value.Length < 6)
+                if (value.Length <= 6)
                 {
                     throw new AppException(MessagesExceptions.SizeFieldAddressNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetAddress_Ok

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:44:21
             {
                 if (value.Length < 6)
                 {
-                    throw new AppException(MessagesExceptions.SizeFieldAddressNotValid);
+                    ;
                 }
                 _address = value;
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetAddress_Failed

[Killed] Negate expression
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:54:21
             get => _photo;
             set
             {
-                if (string.IsNullOrWhiteSpace(value))
+                if (!(string.IsNullOrWhiteSpace(value)))
                 {
                     throw new AppException(MessagesExceptions.PhotoCannotBeEmpty);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_Failed; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithExtensionSvg_Failed; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithUriInvalid_Failed

[Killed] String mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:54:21
             get => _photo;
             set
             {
-                if (string.IsNullOrWhiteSpace(value))
+                if ((value!=null))
                 {
                     throw new AppException(MessagesExceptions.PhotoCannotBeEmpty);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithExtensionSvg_Failed; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithUriInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:56:21
             {
                 if (string.IsNullOrWhiteSpace(value))
                 {
-                    throw new AppException(MessagesExceptions.PhotoCannotBeEmpty);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_Failed

[Killed] Logical mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:59:21
                     throw new AppException(MessagesExceptions.PhotoCannotBeEmpty);
                 }
 
-                if (!Uri.TryCreate(value, UriKind.Absolute, out var uriResult) ||
-                    !(uriResult.Scheme == Uri.UriSchemeHttp || uriResult.Scheme == Uri.UriSchemeHttps))
+                if (!Uri.TryCreate(value, UriKind.Absolute, out var uriResult) &&
+                    !(uriResult.Scheme == Uri.UriSchemeHttp || uriResult.Scheme == Uri.UriSchemeHttps))
                 {
                     throw new AppException(MessagesExceptions.PhotoUrlNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithUriInvalid_Failed

[Killed] Negate expression
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:59:21
                     throw new AppException(MessagesExceptions.PhotoCannotBeEmpty);
                 }
 
-                if (!Uri.TryCreate(value, UriKind.Absolute, out var uriResult) ||
-                    !(uriResult.Scheme == Uri.UriSchemeHttp || uriResult.Scheme == Uri.UriSchemeHttps))
+                if (!(!Uri.TryCreate(value, UriKind.Absolute, out var uriResult) ||
+                    !(uriResult.Scheme == Uri.UriSchemeHttp || uriResult.Scheme == Uri.UriSchemeHttps)))
                 {
                     throw new AppException(MessagesExceptions.PhotoUrlNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithExtensionSvg_Failed; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithUriInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed

[Killed] Logical mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:60:23
                 }
 
                 if (!Uri.TryCreate(value, UriKind.Absolute, out var uriResult) ||
-                    !(uriResult.Scheme == Uri.UriSchemeHttp || uriResult.Scheme == Uri.UriSchemeHttps))
+                    !(uriResult.Scheme == Uri.UriSchemeHttp && uriResult.Scheme == Uri.UriSchemeHttps))
                 {
                     throw new AppException(MessagesExceptions.PhotoUrlNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithExtensionSvg_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Ok

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:60:64
                 }
 
                 if (!Uri.TryCreate(value, UriKind.Absolute, out var uriResult) ||
-                    !(uriResult.Scheme == Uri.UriSchemeHttp || uriResult.Scheme == Uri.UriSchemeHttps))
+                    !(uriResult.Scheme == Uri.UriSchemeHttp || uriResult.Scheme != Uri.UriSchemeHttps))
                 {
                     throw new AppException(MessagesExceptions.PhotoUrlNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithExtensionSvg_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Ok

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:62:21
                 if (!Uri.TryCreate(value, UriKind.Absolute, out var uriResult) ||
                     !(uriResult.Scheme == Uri.UriSchemeHttp || uriResult.Scheme == Uri.UriSchemeHttps))
                 {
-                    throw new AppException(MessagesExceptions.PhotoUrlNotValid);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithUriInvalid_Failed

[Killed] Logical mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:65:21
                     throw new AppException(MessagesExceptions.PhotoUrlNotValid);
                 }
 
-                if (!value.EndsWith(".jpg") && !value.EndsWith(".png") && !value.EndsWith(".jpeg"))
+                if (!value.EndsWith(".jpg") && !value.EndsWith(".png") || !value.EndsWith(".jpeg"))
                 {
                     throw new AppException(MessagesExceptions.PhotoFileTypeNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.ObtainListOwnersAsync_WithFilter_Ok

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:65:21
                     throw new AppException(MessagesExceptions.PhotoUrlNotValid);
                 }
 
-                if (!value.EndsWith(".jpg") && !value.EndsWith(".png") && !value.EndsWith(".jpeg"))
+                if (value.EndsWith(".jpg") && !value.EndsWith(".png") && !value.EndsWith(".jpeg"))
                 {
                     throw new AppException(MessagesExceptions.PhotoFileTypeNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithExtensionSvg_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.ObtainListOwnersAsync_WithFilter_Ok; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.ObtainListOwnersAsync_WithoutFilter_Ok

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:67:21
 
                 if (!value.EndsWith(".jpg") && !value.EndsWith(".png") && !value.EndsWith(".jpeg"))
                 {
-                    throw new AppException(MessagesExceptions.PhotoFileTypeNotValid);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetPhoto_WithExtensionSvg_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:78:21
             get => _birthday;
             set
             {
-                if (value > DateTime.Now)
+                if (value < DateTime.Now)
                 {
                     throw new AppException(MessagesExceptions.BirthdayCannotBeInFuture);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age100_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age18_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_AgeCannotExceed100_Failed

[Killed] Negate expression
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:78:21
             get => _birthday;
             set
             {
-                if (value > DateTime.Now)
+                if (!(value > DateTime.Now))
                 {
                     throw new AppException(MessagesExceptions.BirthdayCannotBeInFuture);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age100_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age18_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_AgeCannotExceed100_Failed

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:80:21
             {
                 if (value > DateTime.Now)
                 {
-                    throw new AppException(MessagesExceptions.BirthdayCannotBeInFuture);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_BirthdayCannotBeInFuture_Failed

[Killed] Arithmetic mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:83:27
                     throw new AppException(MessagesExceptions.BirthdayCannotBeInFuture);
                 }
 
-                var age = DateTime.Now.Year - value.Year;
+                var age = DateTime.Now.Year + value.Year;
                 if (value.Date > DateTime.Now.AddYears(-age)) age--;
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age100_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age18_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_AgeCannotExceed100_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:84:21
                 }
 
                 var age = DateTime.Now.Year - value.Year;
-                if (value.Date > DateTime.Now.AddYears(-age)) age--;
+                if (value.Date < DateTime.Now.AddYears(-age)) age--;
 
                 if (age < 18)
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age18_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_AgeCannotExceed100_Failed

[Killed] Negate expression
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:84:21
                 }
 
                 var age = DateTime.Now.Year - value.Year;
-                if (value.Date > DateTime.Now.AddYears(-age)) age--;
+                if (!(value.Date > DateTime.Now.AddYears(-age))) age--;
 
                 if (age < 18)
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age18_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_AgeCannotExceed100_Failed

[Killed] Negate expression
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:86:21
                 var age = DateTime.Now.Year - value.Year;
                 if (value.Date > DateTime.Now.AddYears(-age)) age--;
 
-                if (age < 18)
+                if (!(age < 18))
                 {
                     throw new AppException(MessagesExceptions.AgeMustBeAtLeast18);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age100_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age18_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_AgeCannotExceed100_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:86:21
                 var age = DateTime.Now.Year - value.Year;
                 if (value.Date > DateTime.Now.AddYears(-age)) age--;
 
-                if (age < 18)
+                if (age <= 18)
                 {
                     throw new AppException(MessagesExceptions.AgeMustBeAtLeast18);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age18_Ok

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:88:21
 
                 if (age < 18)
                 {
-                    throw new AppException(MessagesExceptions.AgeMustBeAtLeast18);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_AgeMustBeAtLeast18_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:91:21
                     throw new AppException(MessagesExceptions.AgeMustBeAtLeast18);
                 }
 
-                if (age > 100)
+                if (age >= 100)
                 {
                     throw new AppException(MessagesExceptions.AgeCannotExceed100);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age100_Ok

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:91:21
                     throw new AppException(MessagesExceptions.AgeMustBeAtLeast18);
                 }
 
-                if (age > 100)
+                if (age < 100)
                 {
                     throw new AppException(MessagesExceptions.AgeCannotExceed100);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_Age18_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_AgeCannotExceed100_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Owner.cs:93:21
 
                 if (age > 100)
                 {
-                    throw new AppException(MessagesExceptions.AgeCannotExceed100);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.OwnerTest.SetBirthday_AgeCannotExceed100_Failed
