[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Property.cs:60:21
             {
                 if (value <= 0)
                 {
-                    throw new AppException(MessagesExceptions.PriceNotValid);
+                    ;
                 }
                 _price = value;
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTest.SetPrice_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Property.cs:70:21
             get => _codeInternal;
             set
             {
-                if (value.Length < 4)
+                if (value.Length > 4)
                 {
                     throw new AppException(MessagesExceptions.SizeFieldCodeInternalNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTest.SetCodeInternal_Failed; PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTest.SetCodeInternal_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Property.cs:70:21
             get => _codeInternal;
             set
             {
-                if (value.Length < 4)
+                if (value.Length <= 4)
                 {
                     throw new AppException(MessagesExceptions.SizeFieldCodeInternalNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_GetMaxPropertyFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_NumberFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_Ok

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Property.cs:72:21
             {
                 if (value.Length < 4)
                 {
-                    throw new AppException(MessagesExceptions.SizeFieldCodeInternalNotValid);
+                    ;
                 }
                 _codeInternal = value;
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTest.SetCodeInternal_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Property.cs:82:21
             get => _year;
             set
             {
-                if (value < 1900)
+                if (value <= 1900)
                 {
                     throw new AppException(MessagesExceptions.YearNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTest.SetYear_Ok

[Killed] Negate expression
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Property.cs:82:21
             get => _year;
             set
             {
-                if (value < 1900)
+                if (!(value < 1900))
                 {
                     throw new AppException(MessagesExceptions.YearNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTest.SetYear_Failed; PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTest.SetYear_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_GetMaxPropertyFilesInvalid_Failed

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/Property.cs:84:21
             {
                 if (value < 1900)
                 {
-                    throw new AppException(MessagesExceptions.YearNotValid);
+                    ;
                 }
                 _year = value;
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTest.SetYear_Failed
