[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyImage.cs:39:21
             {
                 if (string.IsNullOrWhiteSpace(value))
                 {
-                    throw new AppException(MessagesExceptions.FileCannotBeEmpty);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyImageTest.SetFile_Failed

[Killed] Logical mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyImage.cs:42:21
                     throw new AppException(MessagesExceptions.FileCannotBeEmpty);
                 }
 
-                if (!value.EndsWith(".jpg", StringComparison.OrdinalIgnoreCase) &&
-                    !value.EndsWith(".png", StringComparison.OrdinalIgnoreCase) &&
+                if (!value.EndsWith(".jpg", StringComparison.OrdinalIgnoreCase) ||
+                    !value.EndsWith(".png", StringComparison.OrdinalIgnoreCase) &&
                     !value.EndsWith(".jpeg", StringComparison.OrdinalIgnoreCase))
                 {
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_GetMaxPropertyFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_NumberFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_Ok

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyImage.cs:42:21
                     throw new AppException(MessagesExceptions.FileCannotBeEmpty);
                 }
 
-                if (!value.EndsWith(".jpg", StringComparison.OrdinalIgnoreCase) &&
+                if (value.EndsWith(".jpg", StringComparison.OrdinalIgnoreCase) &&
                     !value.EndsWith(".png", StringComparison.OrdinalIgnoreCase) &&
                     !value.EndsWith(".jpeg", StringComparison.OrdinalIgnoreCase))
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyImageTest.SetFile_WithExtensionSvg_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.ObtainListPropertyImagesAsync_WithFilter_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.ObtainListPropertyImagesAsync_WithoutFilter_Ok

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyImage.cs:43:21
                 }
 
                 if (!value.EndsWith(".jpg", StringComparison.OrdinalIgnoreCase) &&
-                    !value.EndsWith(".png", StringComparison.OrdinalIgnoreCase) &&
+                    value.EndsWith(".png", StringComparison.OrdinalIgnoreCase) &&
                     !value.EndsWith(".jpeg", StringComparison.OrdinalIgnoreCase))
                 {
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyImageTest.SetFile_WithExtensionSvg_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_GetMaxPropertyFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_NumberFilesInvalid_Failed

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyImage.cs:44:21
 
                 if (!value.EndsWith(".jpg", StringComparison.OrdinalIgnoreCase) &&
                     !value.EndsWith(".png", StringComparison.OrdinalIgnoreCase) &&
-                    !value.EndsWith(".jpeg", StringComparison.OrdinalIgnoreCase))
+                    value.EndsWith(".jpeg", StringComparison.OrdinalIgnoreCase))
                 {
                     throw new AppException(MessagesExceptions.FileTypeNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyImageTest.SetFile_WithExtensionSvg_Failed

[Killed] String mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyImage.cs:44:37
 
                 if (!value.EndsWith(".jpg", StringComparison.OrdinalIgnoreCase) &&
                     !value.EndsWith(".png", StringComparison.OrdinalIgnoreCase) &&
-                    !value.EndsWith(".jpeg", StringComparison.OrdinalIgnoreCase))
+                    !value.EndsWith("", StringComparison.OrdinalIgnoreCase))
                 {
                     throw new AppException(MessagesExceptions.FileTypeNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyImageTest.SetFile_WithExtensionSvg_Failed

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyImage.cs:46:21
                     !value.EndsWith(".png", StringComparison.OrdinalIgnoreCase) &&
                     !value.EndsWith(".jpeg", StringComparison.OrdinalIgnoreCase))
                 {
-                    throw new AppException(MessagesExceptions.FileTypeNotValid);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyImageTest.SetFile_WithExtensionSvg_Failed
