[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:33:21
             {
                 if (value > DateTime.Now)
                 {
-                    throw new AppException(MessagesExceptions.DateSaleCannotBeInFuture);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.DateSale_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:44:21
             get => _name;
             set
             {
-                if (value.Length < 3)
+                if (value.Length > 3)
                 {
                     throw new AppException(MessagesExceptions.SizeFieldNameNotValid);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetName_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:58:21
             {
                 if (value <= 0)
                 {
-                    throw new AppException(MessagesExceptions.ValueMustBePositive);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetValue_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:61:21
                     throw new AppException(MessagesExceptions.ValueMustBePositive);
                 }
 
-                if (value < 1000)
+                if (value <= 1000)
                 {
                     throw new AppException(MessagesExceptions.ValueTooLow);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyPriceAsync_Ok

[Killed] Negate expression
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:61:21
                     throw new AppException(MessagesExceptions.ValueMustBePositive);
                 }
 
-                if (value < 1000)
+                if (!(value < 1000))
                 {
                     throw new AppException(MessagesExceptions.ValueTooLow);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetTax_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetValue_Ok; PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetValue_ValueBaseInvalid_Failed

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:63:21
 
                 if (value < 1000)
                 {
-                    throw new AppException(MessagesExceptions.ValueTooLow);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetValue_ValueBaseInvalid_Failed

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:76:21
             {
                 if (value < 0)
                 {
-                    throw new AppException(MessagesExceptions.TaxCannotBeNegative);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetTax_Failed

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:79:21
                     throw new AppException(MessagesExceptions.TaxCannotBeNegative);
                 }
 
-                if (value > 100)
+                if (value >= 100)
                 {
                     throw new AppException(MessagesExceptions.TaxCannotExceed100Percent);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetTax_Ok

[Killed] Equality mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:79:21
                     throw new AppException(MessagesExceptions.TaxCannotBeNegative);
                 }
 
-                if (value > 100)
+                if (value < 100)
                 {
                     throw new AppException(MessagesExceptions.TaxCannotExceed100Percent);
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetTax_TaxBaseInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok

[Killed] Statement mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:81:21
 
                 if (value > 100)
                 {
-                    throw new AppException(MessagesExceptions.TaxCannotExceed100Percent);
+                    ;
                 }
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetTax_TaxBaseInvalid_Failed

[Killed] Arithmetic mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:87:45
                 _tax = value;
             }
         }
-        public decimal TotalTax => Value * (Tax / 100m);
+        public decimal TotalTax => Value * (Tax * 100m);
 
         public Guid IdProperty
killedBy: PROPERTY_MANAGER.Domain.Tests.Entities.PropertyTraceTest.SetTax_Ok

[Survived] Arithmetic mutation
PropertyManager/PROPERTY_MANAGER.Domain/Entities/PropertyTrace.cs:87:36
                 _tax = value;
             }
         }
-        public decimal TotalTax => Value * (Tax / 100m);
+        public decimal TotalTax => Value / (Tax / 100m);
 
         public Guid IdProperty
