[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:25:13
             DateTime birthday
         )
         {
-            await ValidatePropertyUniqueAsync(owner => owner.Name, name, MessagesExceptions.NameAlreadyExistsMessage);
+            ;
             await ValidatePropertyUniqueAsync(owner => owner.Address, address, MessagesExceptions.AddressAlreadyExistsMessage);
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:26:13
         )
         {
             await ValidatePropertyUniqueAsync(owner => owner.Name, name, MessagesExceptions.NameAlreadyExistsMessage);
-            await ValidatePropertyUniqueAsync(owner => owner.Address, address, MessagesExceptions.AddressAlreadyExistsMessage);
+            ;
 
             Owner owner = new()
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:49:13
             DateTime birthday
         )
         {
-            await ValidatePropertyUniqueAsync(owner => owner.Name, name, MessagesExceptions.NameAlreadyExistsMessage, excludeId: idOwner);
+            ;
             await ValidatePropertyUniqueAsync(owner => owner.Address, address, MessagesExceptions.AddressAlreadyExistsMessage, excludeId: idOwner);
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.UpdateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.UpdateOwnerAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:50:13
         )
         {
             await ValidatePropertyUniqueAsync(owner => owner.Name, name, MessagesExceptions.NameAlreadyExistsMessage, excludeId: idOwner);
-            await ValidatePropertyUniqueAsync(owner => owner.Address, address, MessagesExceptions.AddressAlreadyExistsMessage, excludeId: idOwner);
+            ;
 
             Owner? owner = await ObtainOwnerByIdAsync(idOwner);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.UpdateOwnerAsync_Ok

[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:67:9
         public async Task<Owner> ObtainOwnerByIdAsync(
             Guid idOwner
         )
-        {
-            Owner? owner = await ownerRepository.GetByIdAsync(
-                idOwner
-            ) ??
-            throw new AppException(
-                string.Format(
-                    CultureInfo.InvariantCulture,
-                    MessagesExceptions.OwnerNotFoundMessage,
-                    idOwner
-                )
-            );
-
-            return owner;
-        }
+        {}
 
         public async Task<List<Owner>> ObtainListOwnersAsync(
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.ObtainOwnerByIdAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.ObtainOwnerByIdAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.UpdateOwnerAsync_Ok

[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:85:9
         public async Task<List<Owner>> ObtainListOwnersAsync(
             IEnumerable<FieldFilter> fieldFilter
         )
-        {            
-            IEnumerable<Owner> properties =
-            await queryWrapper
-                .QueryAsync<Owner>(
-                    ItemsMessageConstants.GetOwners
-                        .GetDescription(),
-                    new
-                    { },
-                    FieldFilterHelper.BuildQueryArgs(fieldFilter)
-                );
-
-            return properties.ToList();            
-        }        
+        {}        
 
         private async Task ValidatePropertyUniqueAsync<TProperty>(
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.ObtainListOwnersAsync_WithFilter_Ok; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.ObtainListOwnersAsync_WithoutFilter_Ok

[Killed] Negate expression
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:112:17
             BinaryExpression comparison = Expression.Equal(property, constant);
 
             Expression? excludeCondition = null;
-            if (excludeId.HasValue)
+            if (!(excludeId.HasValue))
             {
                 MemberExpression idProperty = Expression.Property(parameter, nameof(Owner.IdOwner));
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Ok

[Survived] Block removal mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:113:13
 
             Expression? excludeCondition = null;
             if (excludeId.HasValue)
-            {
-                MemberExpression idProperty = Expression.Property(parameter, nameof(Owner.IdOwner));
-                ConstantExpression excludeIdConstant = Expression.Constant(excludeId.Value, typeof(Guid));
-                excludeCondition = Expression.NotEqual(idProperty, excludeIdConstant);
-            }
+            {}
 
             Expression finalCondition = excludeCondition != null

[Killed] Equality mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:119:41
                 excludeCondition = Expression.NotEqual(idProperty, excludeIdConstant);
             }
 
-            Expression finalCondition = excludeCondition != null
+            Expression finalCondition = excludeCondition == null
                 ? Expression.AndAlso(comparison, excludeCondition)
                 : comparison;
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Ok

[Killed] Conditional (true) mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:119:41
                 excludeCondition = Expression.NotEqual(idProperty, excludeIdConstant);
             }
 
-            Expression finalCondition = excludeCondition != null
-                ? Expression.AndAlso(comparison, excludeCondition)
-                : comparison;
+            Expression finalCondition = (true?Expression.AndAlso(comparison, excludeCondition)
+:comparison);
 
             Expression<Func<Owner, bool>> filterExpression = Expression.Lambda<Func<Owner, bool>>(finalCondition, parameter);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Ok

[Killed] Negate expression
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:127:17
 
             IEnumerable<Owner> listOwner = await ownerRepository.GetAsync(filterExpression);
 
-            if (listOwner.Any())
+            if (!(listOwner.Any()))
             {
                 throw new AppException(errorMessage);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.UpdateOwnerAsync_Failed

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/owner/OwnerService.cs:129:17
 
             if (listOwner.Any())
             {
-                throw new AppException(errorMessage);
+                ;
             }
         }
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.CreateOwnerAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.OwnerServiceTest.UpdateOwnerAsync_Failed
