[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:36:13
                 Enabled = enabled
             };
 
-            await ValidateMaxPropertyFiles(propertyImage);
+            ;
 
             propertyImage = await propertyImageRepository.AddAsync(propertyImage);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_GetMaxPropertyFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_NumberFilesInvalid_Failed

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:58:13
             propertyImage.Enabled = enabled;
             propertyImage.IdProperty = property.IdProperty;
 
-            await ValidateMaxPropertyFiles(propertyImage, idProperty);
+            ;
 
             propertyImage = await propertyImageRepository.UpdateAsync(propertyImage);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.UpdatePropertyImageAsync_NumberFilesInvalid_Failed

[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:68:9
         public async Task<PropertyImage> ObtainPropertyImageByIdAsync(
             Guid idPropertyImage
         )
-        {
-            PropertyImage? propertyImage = await propertyImageRepository.GetByIdAsync(
-                idPropertyImage
-            ) ??
-            throw new AppException(
-                string.Format(
-                    CultureInfo.InvariantCulture,
-                    MessagesExceptions.PropertyImageNotFoundByIdMessage,
-                    idPropertyImage
-                )
-            );
-
-            return propertyImage;
-        }
+        {}
 
         public async Task<List<PropertyImage>> ObtainListPropertyImageAsync(
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.ObtainPropertyImageByIdAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.ObtainPropertyImageByIdAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.UpdatePropertyImageAsync_NumberFilesInvalid_Failed

[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:86:9
         public async Task<List<PropertyImage>> ObtainListPropertyImageAsync(
             IEnumerable<FieldFilter> fieldFilter
         )
-        {
-
-            IEnumerable<PropertyImage> properties =
-                await queryWrapper
-                    .QueryAsync<PropertyImage>(
-                        ItemsMessageConstants.GetPropertiesImages
-                            .GetDescription(),
-                        new
-                        { },
-                        FieldFilterHelper.BuildQueryArgs(fieldFilter)
-                    );
-
-            return properties.ToList();
-        }
+        {}
         
         private int GetMaxPropertyFiles()
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.ObtainListPropertyImagesAsync_WithFilter_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.ObtainListPropertyImagesAsync_WithoutFilter_Ok

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:104:17
         private int GetMaxPropertyFiles()
         {
             string? maxPropertyFilesValue = configuration["MaxPropertyFiles"];
-            if (!int.TryParse(maxPropertyFilesValue, out int maxPropertyFiles))
+            if (int.TryParse(maxPropertyFilesValue, out int maxPropertyFiles))
             {
                 throw new AppException(
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_GetMaxPropertyFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_NumberFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:106:17
             string? maxPropertyFilesValue = configuration["MaxPropertyFiles"];
             if (!int.TryParse(maxPropertyFilesValue, out int maxPropertyFiles))
             {
-                throw new AppException(
-                    MessagesExceptions.MaxPropertyFilesInvalidMessage
-                );
+                ;
             }
             return maxPropertyFiles;
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_GetMaxPropertyFilesInvalid_Failed

[NoCoverage] Logical mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:121:25
             List<PropertyImage> listPropertiesImages = (
                 await propertyImageRepository.GetAsync(
                     item => 
-                        item.IdProperty == propertyImage.IdProperty &&
-                        (!excludeId.HasValue || item.IdProperty != excludeId.Value)
+                        item.IdProperty == propertyImage.IdProperty ||
+                        (!excludeId.HasValue || item.IdProperty != excludeId.Value)
                 )
             ).ToList();

[NoCoverage] Equality mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:121:25
             List<PropertyImage> listPropertiesImages = (
                 await propertyImageRepository.GetAsync(
                     item => 
-                        item.IdProperty == propertyImage.IdProperty &&
+                        item.IdProperty != propertyImage.IdProperty &&
                         (!excludeId.HasValue || item.IdProperty != excludeId.Value)
                 )

[NoCoverage] Equality mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:122:49
                 await propertyImageRepository.GetAsync(
                     item => 
                         item.IdProperty == propertyImage.IdProperty &&
-                        (!excludeId.HasValue || item.IdProperty != excludeId.Value)
+                        (!excludeId.HasValue || item.IdProperty == excludeId.Value)
                 )
             ).ToList();

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:122:26
                 await propertyImageRepository.GetAsync(
                     item => 
                         item.IdProperty == propertyImage.IdProperty &&
-                        (!excludeId.HasValue || item.IdProperty != excludeId.Value)
+                        (excludeId.HasValue || item.IdProperty != excludeId.Value)
                 )
             ).ToList();

[Survived] Statement mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:126:13
                 )
             ).ToList();
 
-            listPropertiesImages.Add(propertyImage);
+            ;
 
             int maxPropertyFiles = GetMaxPropertyFiles();

[Killed] Negate expression
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:129:17
             listPropertiesImages.Add(propertyImage);
 
             int maxPropertyFiles = GetMaxPropertyFiles();
-            if (listPropertiesImages.ToList().Count >= maxPropertyFiles)
+            if (!(listPropertiesImages.ToList().Count >= maxPropertyFiles))
             {
                 throw new AppException(
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_NumberFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.UpdatePropertyImageAsync_NumberFilesInvalid_Failed

[Survived] Equality mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:129:17
             listPropertiesImages.Add(propertyImage);
 
             int maxPropertyFiles = GetMaxPropertyFiles();
-            if (listPropertiesImages.ToList().Count >= maxPropertyFiles)
+            if (listPropertiesImages.ToList().Count > maxPropertyFiles)
             {
                 throw new AppException(

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/propertyImage/PropertyImageService.cs:131:17
             int maxPropertyFiles = GetMaxPropertyFiles();
             if (listPropertiesImages.ToList().Count >= maxPropertyFiles)
             {
-                throw new AppException(
-                    string.Format(
-                        CultureInfo.InvariantCulture,
-                        MessagesExceptions.MaxPropertyFilesMessage,
-                        maxPropertyFiles
-                    )
-                );
+                ;
             }
         }
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_NumberFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.UpdatePropertyImageAsync_NumberFilesInvalid_Failed
