[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/propertyTrace/PropertyTraceService.cs:24:9
             int tax,
             Guid idProperty
         )
-        {
-            PropertyTrace propertyTrace = new()
-            {
-                DateSale = dateSale,
-                Name = name,
-                Value = value,
-                Tax = tax,
-                IdProperty = idProperty
-            };
-
-            propertyTrace = await propertyTraceRepository.AddAsync(propertyTrace);
-
-            return propertyTrace;
-        }
+        {}
 
         public async Task<PropertyTrace> UpdatePropertyTraceAsync(
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyPriceAsync_Ok

[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/propertyTrace/PropertyTraceService.cs:47:9
             int tax,
             Guid idProperty
         )
-        {
-            PropertyTrace? propertyTrace = await ObtainPropertyTraceByIdAsync(idPropertyTrace);
-
-            propertyTrace.IdProperty = idProperty;
-            propertyTrace.DateSale = dateSale;
-            propertyTrace.Name = name;
-            propertyTrace.Value = value;
-            propertyTrace.Tax = tax;
-
-            propertyTrace = await propertyTraceRepository.UpdateAsync(propertyTrace);
-
-            return propertyTrace;
-        }
+        {}
 
         public async Task<PropertyTrace> ObtainPropertyTraceByIdAsync(
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyTraceServiceTest.UpdatePropertyTraceAsync_Ok

[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/propertyTrace/PropertyTraceService.cs:64:9
         public async Task<PropertyTrace> ObtainPropertyTraceByIdAsync(
             Guid idPropertyTrace
         )
-        {
-            PropertyTrace? propertyTrace = await propertyTraceRepository.GetByIdAsync(
-                idPropertyTrace
-            ) ??
-            throw new AppException(
-                string.Format(
-                    CultureInfo.InvariantCulture,
-                    MessagesExceptions.PropertyTraceNotFoundMessage,
-                    idPropertyTrace
-                )
-            );
-
-            return propertyTrace;
-        }
+        {}
 
         public async Task<List<PropertyTrace>> ObtainListPropertyTraceAsync(
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyTraceServiceTest.ObtainPropertyTraceByIdAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyTraceServiceTest.ObtainPropertyTraceByIdAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyTraceServiceTest.UpdatePropertyTraceAsync_Ok

[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/propertyTrace/PropertyTraceService.cs:82:9
         public async Task<List<PropertyTrace>> ObtainListPropertyTraceAsync(
             IEnumerable<FieldFilter> fieldFilter
         )
-        {
-            IEnumerable<PropertyTrace> properties =
-                await queryWrapper
-                    .QueryAsync<PropertyTrace>(
-                        ItemsMessageConstants.GetPropertiesTraces
-                            .GetDescription(),
-                        new
-                        { },
-                        FieldFilterHelper.BuildQueryArgs(fieldFilter)
-                    );
-
-            return properties.ToList();
-        }
+        {}
     }
 }
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyTraceServiceTest.ObtainListPropertyTraceAsync_WithFilter_Ok
