[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:35:13
         {
             Owner owner = await ownerService.ObtainOwnerByIdAsync(idOwner);
 
-            await ValidatePropertyUniqueAsync(property => property.Name, name, MessagesExceptions.NameAlreadyExistsMessage);
+            ;
             await ValidatePropertyUniqueAsync(property => property.Address, address, MessagesExceptions.AddressAlreadyExistsMessage);
             await ValidatePropertyUniqueAsync(property => property.CodeInternal, codeInternal, MessagesExceptions.CodeInternalAlreadyExistsMessage);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:36:13
             Owner owner = await ownerService.ObtainOwnerByIdAsync(idOwner);
 
             await ValidatePropertyUniqueAsync(property => property.Name, name, MessagesExceptions.NameAlreadyExistsMessage);
-            await ValidatePropertyUniqueAsync(property => property.Address, address, MessagesExceptions.AddressAlreadyExistsMessage);
+            ;
             await ValidatePropertyUniqueAsync(property => property.CodeInternal, codeInternal, MessagesExceptions.CodeInternalAlreadyExistsMessage);
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:37:13
 
             await ValidatePropertyUniqueAsync(property => property.Name, name, MessagesExceptions.NameAlreadyExistsMessage);
             await ValidatePropertyUniqueAsync(property => property.Address, address, MessagesExceptions.AddressAlreadyExistsMessage);
-            await ValidatePropertyUniqueAsync(property => property.CodeInternal, codeInternal, MessagesExceptions.CodeInternalAlreadyExistsMessage);
+            ;
 
             int tax = GetTax();
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:53:13
 
             property = await propertyRepository.AddAsync(property);
 
-            await propertyTraceService.CreatePropertyTraceAsync(
-                DateTime.Now,
-                "Initial Sale",
-                price,
-                tax,
-                property.IdProperty
-            );
+            ;
 
             return property;
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:76:13
         {
             Owner owner = await ownerService.ObtainOwnerByIdAsync(idOwner);
 
-            await ValidatePropertyUniqueAsync(property => property.Name, name, MessagesExceptions.NameAlreadyExistsMessage, excludeId: idProperty);
+            ;
             await ValidatePropertyUniqueAsync(property => property.Address, address, MessagesExceptions.AddressAlreadyExistsMessage, excludeId: idProperty);
             await ValidatePropertyUniqueAsync(property => property.CodeInternal, codeInternal, MessagesExceptions.CodeInternalAlreadyExistsMessage, excludeId: idProperty);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:77:13
             Owner owner = await ownerService.ObtainOwnerByIdAsync(idOwner);
 
             await ValidatePropertyUniqueAsync(property => property.Name, name, MessagesExceptions.NameAlreadyExistsMessage, excludeId: idProperty);
-            await ValidatePropertyUniqueAsync(property => property.Address, address, MessagesExceptions.AddressAlreadyExistsMessage, excludeId: idProperty);
+            ;
             await ValidatePropertyUniqueAsync(property => property.CodeInternal, codeInternal, MessagesExceptions.CodeInternalAlreadyExistsMessage, excludeId: idProperty);
 
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:78:13
 
             await ValidatePropertyUniqueAsync(property => property.Name, name, MessagesExceptions.NameAlreadyExistsMessage, excludeId: idProperty);
             await ValidatePropertyUniqueAsync(property => property.Address, address, MessagesExceptions.AddressAlreadyExistsMessage, excludeId: idProperty);
-            await ValidatePropertyUniqueAsync(property => property.CodeInternal, codeInternal, MessagesExceptions.CodeInternalAlreadyExistsMessage, excludeId: idProperty);
+            ;
 
             int tax = GetTax();
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:93:13
 
             property = await propertyRepository.UpdateAsync(property);
 
-            await propertyTraceService.CreatePropertyTraceAsync(
-                DateTime.Now,
-                "Renovation",
-                price,
-                tax,
-                property.IdProperty
-            );
+            ;
 
             return property;
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:114:13
 
             property.Price = price;
             property = await propertyRepository.UpdateAsync(property);
-            await propertyTraceService.CreatePropertyTraceAsync(
-               DateTime.Now,
-               "Price Adjustment",
-               price,
-               tax,
-               property.IdProperty
-            );
+            ;
 
             return property;
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyPriceAsync_Ok

[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:128:9
         public async Task<Property> ObtainPropertyByIdAsync(
             Guid idProperty
         )
-        {
-            Property? property = await propertyRepository.GetByIdAsync(
-                idProperty
-            ) ??
-            throw new AppException(
-                string.Format(
-                    CultureInfo.InvariantCulture,
-                    MessagesExceptions.PropertyNotFoundMessage,
-                    idProperty
-                )
-            );
-
-            return property;
-        }
+        {}
 
         public async Task<List<Property>> ObtainListPropertiesAsync(
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_GetMaxPropertyFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_NumberFilesInvalid_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyImageServiceTest.CreatePropertyImageAsync_Ok

[Killed] Block removal mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:146:9
         public async Task<List<Property>> ObtainListPropertiesAsync(
             IEnumerable<FieldFilter> fieldFilter
         )
-        {
-            IEnumerable<Property> properties =
-                await queryWrapper
-                    .QueryAsync<Property>(
-                        ItemsMessageConstants.GetProperties
-                            .GetDescription(),
-                        new
-                        { },
-                        FieldFilterHelper.BuildQueryArgs(fieldFilter)
-                    );
-
-            return properties.ToList();
-        }
+        {}
 
         private int GetTax()
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.ObtainListPropertiesAsync_WithFilter_Ok

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:163:17
         private int GetTax()
         {
             string? taxValue = configuration["Tax"];
-            if (!int.TryParse(taxValue, out int tax))
+            if (int.TryParse(taxValue, out int tax))
             {
                 throw new AppException(MessagesExceptions.TaxValueInvalidMessage);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok

[Killed] Statement mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:165:17
             string? taxValue = configuration["Tax"];
             if (!int.TryParse(taxValue, out int tax))
             {
-                throw new AppException(MessagesExceptions.TaxValueInvalidMessage);
+                ;
             }
             return tax;
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Failed

[Survived] Block removal mutation
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:184:13
 
             Expression? excludeCondition = null;
             if (excludeId.HasValue)
-            {
-                MemberExpression idProperty = Expression.Property(parameter, nameof(Property.IdProperty));
-                ConstantExpression excludeIdConstant = Expression.Constant(excludeId.Value, typeof(Guid));
-                excludeCondition = Expression.NotEqual(idProperty, excludeIdConstant);
-            }
+            {}
 
             Expression finalCondition = excludeCondition != null

[Killed] Negate expression
PROPERTY_MANAGER.Domain/Services/property/PropertyService.cs:198:17
 
             IEnumerable<Property> listProperty = await propertyRepository.GetAsync(filterExpression);
 
-            if (listProperty.Any())
+            if (!(listProperty.Any()))
             {
                 throw new AppException(errorMessage);
killedBy: PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Failed; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.CreatePropertyAsync_Ok; PROPERTY_MANAGER.Domain.Tests.Services.PropertyServiceTest.UpdatePropertyAsync_Ok
